<template>
  <div class="mailsbox">
    <MessageBox
      username="Иван Филатов"
      message="Таким образом дальнейшее развитие различных форм деятельности требуют определения и уточнения форм развития. Товарищи! постоянное информационно-пропагандистское обеспечение нашей деятельности требуют определения и уточнения позиций, занимаемых участниками в отношении поставленных задач. Таким образом укрепление и развитие структуры играет важную роль в формировании существенных финансовых и административных условий."
      date="23.12.2022"
    ></MessageBox>
    <MessageBox
      username="Иван Филатов"
      message="Таким образом дальнейшее развитие различных форм деятельности требуют определения и уточнения форм развития. Товарищи! постоянное информационно-пропагандистское обеспечение нашей деятельности требуют определения и уточнения позиций, занимаемых участниками в отношении поставленных задач. Таким образом укрепление и развитие структуры играет важную роль в формировании существенных финансовых и административных условий."
      date="23.12.2022"
    ></MessageBox>
    <MessageBox
      username="Иван Филатов"
      message="Таким образом дальнейшее развитие различных форм деятельности требуют определения и уточнения форм развития. Товарищи! постоянное информационно-пропагандистское обеспечение нашей деятельности требуют определения и уточнения позиций, занимаемых участниками в отношении поставленных задач. Таким образом укрепление и развитие структуры играет важную роль в формировании существенных финансовых и административных условий."
      date="23.12.2022"
    ></MessageBox>
    <MessageBox
      username="Иван Филатов"
      message="Таким образом дальнейшее развитие различных форм деятельности требуют определения и уточнения форм развития. Товарищи! постоянное информационно-пропагандистское обеспечение нашей деятельности требуют определения и уточнения позиций, занимаемых участниками в отношении поставленных задач. Таким образом укрепление и развитие структуры играет важную роль в формировании существенных финансовых и административных условий."
      date="23.12.2022"
    ></MessageBox>
    <MessageBox
      username="Иван Филатов"
      message="Таким образом дальнейшее развитие различных форм деятельности требуют определения и уточнения форм развития. Товарищи! постоянное информационно-пропагандистское обеспечение нашей деятельности требуют определения и уточнения позиций, занимаемых участниками в отношении поставленных задач. Таким образом укрепление и развитие структуры играет важную роль в формировании существенных финансовых и административных условий."
      date="23.12.2022"
    ></MessageBox>
    <MessageBox
      username="Иван Филатов"
      message="Таким образом дальнейшее развитие различных форм деятельности требуют определения и уточнения форм развития. Товарищи! постоянное информационно-пропагандистское обеспечение нашей деятельности требуют определения и уточнения позиций, занимаемых участниками в отношении поставленных задач. Таким образом укрепление и развитие структуры играет важную роль в формировании существенных финансовых и административных условий."
      date="23.12.2022"
    ></MessageBox>
  </div>
</template>
<script>
import MessageBox from "./MessageBox.vue";
export default {
  name: "FormWithMessages",
  components: { MessageBox },
};
</script>
<style lang="scss">
.mailsbox {
  width: 90%;
  border: 1px solid #bcbcbc;
  border-radius: 20px;
  margin: auto;
  height: 450px;
  overflow-y: scroll;
  padding-bottom: 20px;
}
</style>
