<template>
  <PostBox
    creater="Ivan Filatov"
    datecreate="2022.04.12 12:23"
    postcontent="Товарищи! рамки и место обучения кадров позволяет оценить значение соответствующий условий активизации. Не следует, однако забывать, что постоянное информационно-пропагандистское обеспечение нашей деятельности способствует подготовки и реализации существенных финансовых и административных условий. Значимость этих проблем настолько очевидна, что новая модель организационной деятельности представляет собой интересный эксперимент проверки соответствующий условий активизации."
    wt="12"
    bt="2"
  ></PostBox>
  <PostBox
    creater="Ivan Filatov"
    datecreate="2022.04.12 12:23"
    postcontent="Товарищи! рамки и место обучения кадров позволяет оценить значение соответствующий условий активизации. Не следует, однако забывать, что постоянное информационно-пропагандистское обеспечение нашей деятельности способствует подготовки и реализации существенных финансовых и административных условий. Значимость этих проблем настолько очевидна, что новая модель организационной деятельности представляет собой интересный эксперимент проверки соответствующий условий активизации."
    wt="12"
    bt="2"
  ></PostBox>
</template>
<script>
import PostBox from "./PostBox.vue";
export default {
  name: "PostList",
  components: { PostBox },
};
</script>
